---
kind: property
id: P:Autodesk.Revit.DB.DetailCurveArray.Size
source: html/9357a627-0cc0-8b8f-f0ec-1ce764209a0c.htm
---
# Autodesk.Revit.DB.DetailCurveArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```